{"schema":5,"addons":[{"id":"{77d2ed30-4cd2-11e0-b8af-0800200c9a66}","icons":{"32":"https://addons.cdn.mozilla.net/img/uploads/addon_icons/295/295337-32.png?modified=1398707562","64":"https://addons.cdn.mozilla.net/img/uploads/addon_icons/295/295337-64.png?modified=1398707562"},"name":"FT DeepDark","type":"theme","version":"9.5.4","repositoryStatus":4,"creator":{"name":"steva","url":"https://addons.mozilla.org/en-US/firefox/user/steva/?src=api"},"description":"Smooth dark theme for Firefox\n• beta version (Firefox 29+ compatible) available here • ","fullDescription":"\"FT DeepDark\" is a theme that has been created to transform the look of Firefox for Windows users. It has been specially designed for Seven (with Aero Style enabled), but rendering is relatively accurate on XP and Linux (I can t test it on MAC, but for those who would like to try it anyway on that platform, you can force download and once the package downloaded on your computer, you can try to install it manually by draggind it into the addon manager). It contains no added functionalities, it's simply a full Firefox's GUI customization.\n\n• Userstyles to customize a bit more your FT Deepdark (such as : dark \"about:home\", \"aero style\" for tabs and tab bar background, translucent scrollbars, darker url bar background, ...) are available here\n• IMPORTANT ! To use those \"userstyles\" you need first to install an add-on called \"Stylish\" which you'll find here\n\n• 10beta17 version available here for download\n\n• What to do when facing an issue with an FT theme ?\n\n1) before reporting it, first try to see if the issue is due to the theme itself. How ? Enable the default theme and check if the issue is still there. If not, enable again the FT theme, but disable all other installed addons to check if the issue can be due to a conflict between addons.\n\n2) If the issue is still there after disabling all other addons and if the default theme doesn t have that issue, try to download and install again the theme (check also if you have the latest version installed, maybe the bug you want to report has already been solved with the latest updates).\n\n3) if after trying what metionned above the problem is linked with the use of the FT theme, please, send me an e-mail (there is a link on the addons page to contact me) rather than reporting the bug on the addons page (I m checking more often my mails so this way I can reply to you quicker, it can be also easier for you to provide me a screenshot or a video of the bug). When sending an e-mail to report a bug, do not forget to tell me which operating system (Windows XP, 7, Vista, Linux, ect.) you are running on your computer, which version of Firefox and FT theme you are using and if you have any operating system custome theme (it can also be a cause of the issue). Then, discribe the most precisely you can the issue you are facing and, if possible, please, join a screenshot and/or a short video so I could see exactly how it looks (english is not my mother tongue as you can easily notice, so a picture can avoid the language problems ;). All that will help me to understand better what is the problem and to solve it quicker if possible (as everyone, my knowledges have limits ;).\nI can t promise you that I ll manage to fix every problems and also in short time, but I ll do my best for it. I m working on FT themes during my free time so it can take a bit time before fixing the issues (you need also to be conscious that any updates need to be checked by Mozilla first, but if you want to have the updates a bit quicker you can follow me on Twitter and know imediately when a new version is available for download).\n\nThanks for visiting the FT Themes pages and enjoy the web with Firefox :)","isPlatformCompatible":true,"eula":"Free for non-commercial personal use. Copyright of all graphics elemets designed for this theme belongs to the AUTHOR. Before any modifications and/or distribution of this work, please contact me (you can use FT DeepDark's support link for that purpose) and read the license file included inside the theme package.","screenshots":[{"url":"https://addons.cdn.mozilla.net/img/uploads/previews/full/115/115112.png?src=api&modified=1393189226","width":"200","height":"150","thumbnailURL":"https://addons.cdn.mozilla.net/img/uploads/previews/thumbs/115/115112.png?src=api&modified=1393189226","thumbnailWidth":"200","thumbnailHeight":"150","caption":"FT Deepdark on Win7"},{"url":"https://addons.cdn.mozilla.net/img/uploads/previews/full/113/113520.png?src=api&modified=1393189226","width":"700","height":"378","thumbnailURL":"https://addons.cdn.mozilla.net/img/uploads/previews/thumbs/113/113520.png?src=api&modified=1393189226","thumbnailWidth":"200","thumbnailHeight":"108","caption":"FT Deepdark on Win7 >  In the addon description you can find the link for my dark style (called \"GT Deepdark\") for Google page. Styilsh addon is required to use the dark style for Google"},{"url":"https://addons.cdn.mozilla.net/img/uploads/previews/full/127/127604.png?src=api&modified=1393189238","width":"674","height":"396","thumbnailURL":"https://addons.cdn.mozilla.net/img/uploads/previews/thumbs/127/127604.png?src=api&modified=1393189238","thumbnailWidth":"200","thumbnailHeight":"118","caption":"FT Deepdark on Win7 > addons manager"},{"url":"https://addons.cdn.mozilla.net/img/uploads/previews/full/106/106108.png?src=api&modified=1393189226","width":"700","height":"410","thumbnailURL":"https://addons.cdn.mozilla.net/img/uploads/previews/thumbs/106/106108.png?src=api&modified=1393189226","thumbnailWidth":"200","thumbnailHeight":"117","caption":"FT Deepdark on Win7 > new tab page"}],"averageRating":5,"learnmoreURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/?src=api","homepageURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/?src=api","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/245160/ft_deepdark-9.5.4-fx-windows.xpi?src=api","size":1283340,"contributionURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/developers?src=api","contributionAmount":"$5.00","developerComments":"Special thanks to :\n\nAxel G., Ken S., Ken B. and Ivana O. for constant support :)","reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/reviews/?src=api","reviewCount":306,"totalDownloads":4454484,"weeklyDownloads":12191,"dailyUsers":205155,"updateDate":1393161614000,"supportURL":null}]}